/*业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，
可可提 成7.5%；20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于 40万元的部分，可提成3%；60万到100万之间时，高于60万元的部     
分，可提成1.5%，高于 100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？*/
#include<stdio.h>
#include<Windows.h>
#pragma warning(disable:4996)

int main()
{
	int I = 0;
	double sum = 0.0;
	printf("请输入利润：\n");
	scanf("%d", &I);
	if (I <= 100000)
	{
		sum = 1.1*I;
	}
	else if (I > 100000 && I < 200000)
	{
		sum = (I - 100000)*1.075 + 110000;
	}
	else if (I >= 200000 && I < 400000)
	{
		sum = (I - 200000)*1.05 + 100000*1.075+110000;
	}
	else if (I >= 400000 && I < 600000)
	{
		sum = (I - 400000)*1.03 + 200000*1.05+100000*1.075+110000;
	}
	else if (I >= 600000 && I < 1000000)
	{
		sum = (I - 600000)*1.015 + 200000*1.03+200000*1.05+100000*1.075+110000;
	}
	else
	{
		sum = (I - 1000000)*1.01 + 4000000 * 1.015 + 200000 * 1.03 + 200000 * 1.05 + 100000 * 1.075 + 110000;
	}
	printf("应发金额总数是：%f\n", sum);

	system("pause");
	return 0;
}